<details><summary>Digger run report at 2026-03-12 03:16:12 (UTC)</summary>
  <details ><summary>Apply output</summary>

```terraform
Terraform will perform the following actions:

  # module.eks.data.tls_certificate.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "cluster" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5"
    }

  # module.eks.aws_eks_access_entry.admins["arn:aws:iam::659474314285:user/cknight"] will be created
  + resource "aws_eks_access_entry" "admins" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "cknight17-dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::659474314285:user/cknight"
      + tags_all          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "cknight17"
        }
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # module.eks.aws_eks_access_policy_association.admins["arn:aws:iam::659474314285:user/cknight"] will be created
  + resource "aws_eks_access_policy_association" "admins" {
      + associated_at = (known after apply)
      + cluster_name  = "cknight17-dev"
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      + principal_arn = "arn:aws:iam::659474314285:user/cknight"

      + access_scope {
          + type = "cluster"
        }
    }

  # module.eks.aws_eks_cluster.this will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "cknight17-dev"
        name                          = "cknight17-dev"
        tags                          = {}
      ~ version                       = "1.31" -> "1.32"
        # (11 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.cluster will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "cluster" {
        id              = "arn:aws:iam::659474314285:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5"
        tags            = {}
      ~ thumbprint_list = [
          - "06b25927c42a721631c1efd9431e648fa62e1e39",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
module.eks.aws_eks_cluster.this: Modifying... [id=cknight17-dev]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 10s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 20s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 30s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 40s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 50s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 1m0s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 1m10s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 1m20s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 1m30s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 1m40s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 1m50s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 2m0s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 2m10s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 2m20s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 2m30s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 2m40s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 2m50s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 3m0s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 3m10s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 3m20s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 3m30s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 3m40s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 3m50s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 4m0s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 4m10s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 4m20s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 4m30s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 4m40s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 4m50s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 5m0s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 5m10s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 5m20s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 5m30s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 5m40s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 5m50s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 6m0s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 6m10s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 6m20s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 6m30s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 6m40s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 6m50s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 7m0s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 7m10s elapsed]
module.eks.aws_eks_cluster.this: Still modifying... [id=cknight17-dev, 7m20s elapsed]
module.eks.aws_eks_cluster.this: Modifications complete after 7m22s [id=cknight17-dev]
module.eks.data.tls_certificate.cluster: Reading...
module.eks.aws_eks_access_entry.admins["arn:aws:iam::659474314285:user/cknight"]: Creating...
module.eks.data.tls_certificate.cluster: Read complete after 0s [id=b1b539daa206035ae3c3e28288b0681fa1b462f3]
module.eks.aws_eks_access_entry.admins["arn:aws:iam::659474314285:user/cknight"]: Creation complete after 0s [id=cknight17-dev:arn:aws:iam::659474314285:user/cknight]
module.eks.aws_eks_access_policy_association.admins["arn:aws:iam::659474314285:user/cknight"]: Creating...
module.eks.aws_eks_access_policy_association.admins["arn:aws:iam::659474314285:user/cknight"]: Creation complete after 1s [id=cknight17-dev#arn:aws:iam::659474314285:user/cknight#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]

Apply complete! Resources: 2 added, 1 changed, 0 destroyed.

Outputs:

argocd_initial_password = "kubectl -n argocd get secret argocd-initial-admin-secret -o jsonpath=\"{.data.password}\" | base64 -d"
cluster_endpoint = "https://AE8FA93863C9398606A41D2F1A4E27F5.gr7.us-east-1.eks.amazonaws.com"
cluster_name = "cknight17-dev"
configure_kubectl = "aws eks update-kubeconfig --name cknight17-dev --region us-east-1"
oidc_provider_arn = "arn:aws:iam::659474314285:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/AE8FA93863C9398606A41D2F1A4E27F5"

```
</details>
</details>